Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.SpaceResolutionOutOfRange Property
 Voxel size is out of range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SpaceResolutionOutOfRange { get; }
Visual Basic
Public Shared ReadOnly Property SpaceResolutionOutOfRange As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SpaceResolutionOutOfRange {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace